app/views/books/show.html.erb

      <div class="average-review-rating" data-score="<%= @average_review %>"></div>
      <span class="number-of-reviews">Based on <%= @book.reviews.count %> Reviews</span>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 9]]