app/controllers/books_controller.rb

SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Biography"]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 3]]
---
	def index
		if params[:category].blank?
			@books = Book.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@books = Book.where(:category_id => @category_id).order("created_at DESC")

INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["author", ""], ["created_at", "2016-05-05 23:33:04.212673"], ["updated_at", "2016-05-05 23:33:04.212673"]]
---
	def create
		@book = current_user.books.build(book_params)
		@book.category_id = params[:category_id]

		if @book.save

UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Blood Meridian: Or the Evening Redness in the West."], ["updated_at", "2016-05-06 23:50:27.481654"], ["id", 3]]
---
	def update
		@book.category_id = params[:category_id]
		if @book.update(book_params)