app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.book_id = @book.id
    @review.user_id = current_user.id

    if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "Great Book!"], ["book_id", 11], ["user_id", 1], ["created_at", "2016-05-09 04:10:36.659924"], ["updated_at", "2016-05-09 04:10:36.659924"]]

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "rating" = ?, "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 4], ["comment", "Great Book!"], ["updated_at", "2016-05-10 00:10:42.909423"], ["id", 1]]